{
"03_transformar":{
      "portugues": {
         "titulo": "atividades",
         "tempo": "As variáveis de tempo foram desagregadas das colunas de 'data hora' em duas colunas distintas: uma para a data e outra para a hora. Além disso, incluímos o nome do dia da semana.",
         "local": "As coordenadas de localização, foi dividida em duas colunas separadas para latitude e longitude. Também adicionamos colunas que representam a latitude e a longitude imediatamente anteriores, permitindo-nos determinar o ponto de origem. Assim é foi calculado o raio de distância em metros entre as posições.",
         "atividade": "Na categoria de atividades, foi incluida a coluna chamada 'motor_ligado', a qual é marcada como True no evento 'chave_ligada' e como False no momento de 'chave_desligada'. Foi eliminanado as linhas associadas às atividades 'primeiro_acerto_do_gps' e 'gsm_metrics-pt' do dataframe, pois compreendemos que essas representam uma calibração inicial da localização e a sua inclusão poderia introduzir distorções na análise"
         },
         
      "ingles": {
         "titulo": "Activities",
         "tempo": "The time variables have been disaggregated from the 'date time' columns into two separate columns: one for the date and another for the time. Additionally, we have included the name of the day of the week",
         "local": "The location coordinates have been separated into two distinct columns for latitude and longitude. We have also added columns representing the immediately preceding latitude and longitude, allowing us to determine the point of origin. This enabled us to calculate the distance radius in meters between the positions.",
         "atividade": "In the activity category, we have included a column called 'motor_ligado,' which is marked as True in the 'chave_ligada' event and as False at the moment of 'chave_desligada.' We have removed the rows associated with the activities 'primeiro_acerto_do_gps' and 'gsm_metrics-pt' from the dataframe, as we understand that these represent an initial location calibration, and their inclusion could introduce distortions into the analysis."
         }
   },   

   "05_atividade":{
      "portugues": {
         "titulo": "atividades",
         "introducao": "Para aprimorar a compreensão dos dados, é essencial **identificar quais informações são pertinentes**, analisar sua distribuição e explorar as relações existentes com outras variáveis, como o **tempo (hora, dia, mês)** e coordenadas geográficas (latitude e longitude).",
         "contagem": "Para aprimorar a compreensão dos dados, é crucial **realizar uma análise da coluna de atividades**, utilizando um filtro para identificar aquelas que são **mais frequentes e relevantes**.",
         "conclusao": "A atividade **'chave_ligada'** e **'chave_desligada'** determina o range de funcionamento do equipamento. A partir disso, foi incluída a coluna de **'motor_ligado'** para determinar o período em que a máquina esteve em funcionamento (True) e desligada (False)."
         },
         
      "ingles": {
         "titulo": "Activities",
         "introducao": "To enhance data understanding, it is essential to **identify which information is relevant**, analyze its distribution, and explore the relationships with other variables, such as **time (hour, day, month)** and geographical coordinates (latitude and longitude).",
         "contagem": "To enhance data understanding, it is crucial to **perform an analysis of the activities column**, using a filter to identify those that are **more frequent and relevant**.",
         "conclusao": "The **'chave_ligada'** and **'chave_desligada'** activities determine the operating range of the equipment. Subsequently, the **'motor_ligado'** column was included to determine the period during which the machine was in operation (True) and turned off (False)."
         }
   },
   "07_comportamento":{
      "portugues": {
         "titulo": "Comportamento Temporal da Maquina",
         "introducao": "Se refere à análise do funcionamento da máquina ao longo do tempo, considerando variáveis como as horas do dia e os fins de semana, especialmente aos domingos. Isso implica em entender como a máquina opera em diferentes momentos do dia e como seu desempenho pode variar durante os dias da semana, com um foco específico nos domingos. Essa análise ajuda a identificar padrões de funcionamento e a tomar decisões relacionadas à eficiência e à manutenção da máquina.",
         },
         
      "ingles": {
         "titulo": "Productive Unproductive ",
         "introducao": "Productive Behavior refers to the period when 'motor_ligado' is **True**, indicating useful activity. Unproductive Behavior occurs when 'motor_ligado' is **False**, indicating inactivity.",
         "contagem": "To enhance data understanding, it is crucial to **perform an analysis of the activities column**, using a filter to identify those that are **more frequent and relevant**.",
         "conclusao": "The **'chave_ligada'** and **'chave_desligada'** activities determine the operating range of the equipment. Subsequently, the **'motor_ligado'** column was included to determine the period during which the machine was in operation (True) and turned off (False)."
         }
}
